package by.javacourse.task3.entity;

public enum GroupATC {
	
	GROUP_A,
	GROUP_B,
	GROUP_C,
	GROUP_D,
	GROUP_G,
	GROUP_H,
	GROUP_J,
	GROUP_L,
	GROUP_M,
	GROUP_N,
	GROUP_P,
	GROUP_R,
	GROUP_S,
	GROUP_V
	
	//Код A: Препараты, влияющие на пищеварительный тракт и обмен веществ
	//Код B: Препараты, влияющие на кроветворение и кровь
	//Код C: Препараты для лечения заболеваний сердечно-сосудистой системы
	//Код D: Препараты для лечения заболеваний кожи
	//Код G: Препараты для лечения заболеваний урогенитальных органов и половые гормоны
	//Код H: Гормональные препараты для системного использования (исключая половые гормоны)
	//Код J: Противомикробные препараты для системного использования
	//Код L: Противоопухолевые препараты и иммуномодуляторы
	//Код M: Препараты для лечения заболеваний костно-мышечной системы
	//Код N: Препараты для лечения заболеваний нервной системы
	//Код P: Противопаразитарные препараты, инсектициды и репелленты
	//Код R: Препараты для лечения заболеваний респираторной системы
	//Код S: Препараты для лечения заболеваний органов чувств
	//Код V: Прочие лекарственные препараты 

}
